app/controllers/application_controller.rb

  def authenticate_user!
    api_key = ApiKey.find_by(token: request.session[:token])
---
SELECT "api_keys".* FROM "api_keys" WHERE "api_keys"."token" IS NULL LIMIT ?  [["LIMIT", 1]]