app/controllers/devices_controller.rb

  def index
    @users = User.all
    @devices = Device.where(user_id: nil)
---
SELECT "users".* FROM "users"
SELECT "devices".* FROM "devices" WHERE "devices"."user_id" IS NULL